Repository: NatLibFi/ekirjasto-feedback
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fi, sv

source: Subject
fi: Aihe
sv: Ämne

source: General feedback
fi: Yleinen palaute
sv: Allmän respons

source: Material procurement
fi: Aineiston hankintaehdotus
sv: Anskaffning av nytt material

source: Material error
fi: Aineiston vikailmoitus
sv: Fel i materialet

source: Technical problem
fi: Tekninen ongelma
sv: Tekniskt problem

source: Other
fi: Muu
sv: Annat

source: Book name
fi: Kirjan nimi
sv: Bokens namn

source: Message
fi: Viesti
sv: Meddelande

source: My home municipality that receives this feedback
fi: Kotikuntani, jolle palaute osoitetaan
sv: Min hemkommun som hanterar denna respons

source: Email address, if you want an answer to your feedback (Optional)
fi: Sähköpostiosoite, johon haluat vastauksen palautteellesi (Valinnainen)
sv: Epostaddress, om du vill ha svar på din respons (Valfritt)

source: Send
fi: Lähetä
sv: Skicka

source: Finnish
fi: Suomi
sv: Suomi

source: Swedish
fi: Svenska
sv: Svenska

source: You can leave feedback about the E-library or suggest materials for acquisition. Suggestions for materials will not be responded to.
fi: Voit jättää palautetta E-kirjastosta tai ehdottaa hankittavia aineistoja. Aineistoehdotuksiin ei vastata.
sv: Du kan lämna feedback om E-biblioteket eller föreslå material för inköp. Förslag på material kommer inte att besvaras

source: Thank you for your feedback!
fi: Kiitos palautteesta!
sv: Tack för din respons!

source: There was a problem sending your message.
fi: Viestin lähetyksessä tapahtui virhe.
sv: Det uppstod ett problem med att skicka ditt meddelande.

source: My home municipality is missing from this list
fi: Kotikuntani puuttuu tästä listasta

source: I don't want to say
fi: En halua kertoa

source: Please select a valid municipality.
sv: Urval är obligatoriskt.

source: Select a municipality
sv: Välj din hemkommun
